// Lab_03_3
// Гринчук Тарас
// Лабораторна робота № 3.3
// Розгалуження, задане графіком функції
// Варіант №4

// Ініціалізуємо змінні
let x, y, R;

// Отримуємо значення x
x = parseInt(prompt("Введіть значення x:"));
// Отримуємо значення R
R = parseInt(prompt("Введіть значення R:"));

if (x <= 0) {
   y = -6 - ((R * x + 6 * R) / 6);
} else if (0 < x && x <= R) {
   y = - Math.sqrt(R * R - x * x);
} else if (R < x && x <= 2 * R) {
   y = Math.sqrt(-3 * R * R - x * x + 4 * x * R);
} else {
   y = R;
}

alert(`Значення y дорівнює ${y}`); // Виводимо значення y
